src/Catalogs/ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапрещеноИзменениеРеквизитов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимОграниченияВзаимосвязей</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОграниченияВзаимосвязей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взаимосвязь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УказыватьРазрешенные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказыватьЗапрещенные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтатусыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	ТекДанные = Элементы.Статусы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаОграниченияВзаимосвязей.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ТекДанные.Статус);
	
	Если ТекДанные.РежимОграниченияВзаимосвязей = ПредопределенноеЗначение("Перечисление.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов.УказыватьЗапрещенные") Тогда
		ЗаголовокОграничения = "Запрещенные взаимосвязи";
	ИначеЕсли ТекДанные.РежимОграниченияВзаимосвязей = ПредопределенноеЗначение("Перечисление.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов.УказыватьРазрешенные") Тогда
		ЗаголовокОграничения = "Разрешенные взаимосвязи";
	Иначе
		ЗаголовокОграничения = "";
	КонецЕсли;
	Элементы.ТаблицаОграниченияВзаимосвязей.Заголовок = ЗаголовокОграничения;
	Элементы.ТаблицаОграниченияВзаимосвязей.Видимость = ЗначениеЗаполнено(ТекДанные.РежимОграниченияВзаимосвязей);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Статусы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Элементы.Статусы.ТекущиеДанные.Статус;

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Статус = Статус;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКоличествоОграниченийПоСтатусам();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоОграниченийПоСтатусам(Статус = Неопределено)
	
	Для каждого СтрокаСтатусов Из Объект.Статусы Цикл
		
		Если НЕ Статус = Неопределено 
			И  СтрокаСтатусов.Статус <> Статус Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = Объект.ТаблицаОграниченияВзаимосвязей.НайтиСтроки(Новый Структура("Статус", СтрокаСтатусов.Статус));
		
		СтрокаСтатусов.КоличествоОграничений = НайденныеСтроки.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейВзаимосвязьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Статус = Элементы.ТаблицаОграниченияВзаимосвязей.ТекущиеДанные.Статус;
	ДанныеВыбора = Справочники.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ДоступныеВзаимосвязиТекущегоСтатуса(Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейВзаимосвязьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.ТаблицаОграниченияВзаимосвязей.ТекущиеДанные.Взаимосвязь = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыРежимОграниченияВзаимосвязейПриИзменении(Элемент)
	ОбновитьОтображениеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьКоличествоОграниченийПоСтатусам();
КонецПроцедуры
